cases/reacting_buoyantPimpleFoam_200muLmin_SI/constant/reactionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

D_AgNO3              D_AgNO3 [0 2 -1 0 0 0 0] 1e-9;
D_tannic             D_tannic [0 2 -1 0 0 0 0] 1e-9;
D_tri                D_tri [0 2 -1 0 0 0 0] 1e-9;
D_H2O                D_H2O [0 2 -1 0 0 0 0] 1e-9;
D_Agl                D_Agl [0 2 -1 0 0 0 0] 1e-9;
D_Ags                D_Ags [0 2 -1 0 0 0 0] 1e-9;
D_Ags2               D_Ags2 [0 2 -1 0 0 0 0] 1e-9;

mw_AgNO3              mw_AgNO3  [1 0 0 0 -1 0 0] 0.16987;
mw_tannic             mw_tannic [1 0 0 0 -1 0 0] 1.70119;
mw_tri                mw_tri    [1 0 0 0 -1 0 0] 0.25806;
mw_H2O                mw_H2O    [1 0 0 0 -1 0 0] 0.018015;
mw_Agl                mw_Agl    [1 0 0 0 -1 0 0] 0.16987;
mw_Ags                mw_Ags    [1 0 0 0 -1 0 0] 0.16987;
mw_Ags2                mw_Ags2  [1 0 0 0 -1 0 0] 0.16987;


kr                kr [0 3 -1 0 -1 0 0] 100;
k1                k1 [0 0 -1 0 0 0 0] 1.75e-05;
k2                k2 [0 3 -1 0 -1 0 0] 1.22e-03;


// ************************************************************************* //
