cases/reacting_buoyantPimpleFoam_200muLmin_SI/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0;
    }

    y_AgNO3
    {

    solver          PBiCGStab;
    preconditioner  DILU;
    tolerance       1e-08;
    relTol          0;
    minIter	     1;
    }

    y_tannic
    {

    solver          PBiCGStab;
    preconditioner  DILU;
    tolerance       1e-08;
    relTol          0;
    minIter	     1;
    }

    y_tri
    {

    solver          PBiCGStab;
    preconditioner  DILU;
    tolerance       1e-08;
    relTol          0;
    minIter	     1;
    }

    y_H2O
    {

    solver          PBiCGStab;
    preconditioner  DILU;
    tolerance       1e-08;
    relTol          0;
    minIter	     1;
    }

    y_Agl
    {

    solver          PBiCGStab;
    preconditioner  DILU;
    tolerance       1e-08;
    relTol          0;
    minIter	     1;
    }

    y_Ags
    {

    solver          PBiCGStab;
    preconditioner  DILU;
    tolerance       1e-08;
    relTol          0;
    minIter	     1;
    }

    y_Ags2
    {

    solver          PBiCGStab;
    preconditioner  DILU;
    tolerance       1e-08;
    relTol          0;
    minIter	     1;
    }

    p_rgh
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 100;
        mergeLevels      1;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.05;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    //U
    //{
        //solver          smoothSolver;
        //smoother        symGaussSeidel;
        //tolerance       1e-05;
        //relTol          0;
    //}

    T 
    {
       solver            PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-7;
        relTol           0;
    }

    "(U|h|e|k|epsilon|R)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|h|e|k|epsilon|R)Final"
    {
        $U;
        relTol          0;
    }

    "moment.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1.0e-8;
        relTol          0;
    }
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 2;
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       1e5;
}



// ************************************************************************* //
